emacs/config.org
#+TITLE: Tate's Emacs Configuration
#+AUTHOR: Evan Tate Paterson Hughes
#+DESCRIPTION: Mostly following DT's guide https://www.youtube.com/watch?v=d1fgypEiQkE, but I'm not quite as EVIL
#+OPTIONS: toc:2


* To-do for the config
*** TODO add more verbose descriptions to all of these things         :org:
*** TODO Rearrange some lines of code for better crash-handling and readability :org:
*** TODO Reorganise Keybindings to use ~General~ and be somewhat more pneumonic :org:
*** TODO Work out Flycheck                                            :org:


* TABLE OF CONTENTS :toc:
- [[#to-do-for-the-config][To-do for the config]]
- [[#elpaca-and-keybindings][Elpaca and Keybindings]]
  - [[#elpaca-package-manager][Elpaca Package Manager]]
  - [[#my-keybindings][My Keybindings]]
  - [[#general-keybindings][General Keybindings]]
  - [[#some-neat-tricks][Some neat tricks]]
- [[#a-tale-of-themes-and-fonts][A Tale of Themes and Fonts]]
  - [[#setting-the-font-face][Setting the font face]]
  - [[#themes-of-dooommmmmm][Themes... of DOOOMMMMMM]]
  - [[#other-aesthetic-changes][Other Aesthetic Changes]]
- [[#agenda][Agenda]]
  - [[#agenda-files][Agenda Files]]
  - [[#custom-agenda][Custom agenda]]
- [[#conveniences][Conveniences]]
  - [[#automatically-create-directories-wtih-c-x-c-f][Automatically create directories wtih C-x C-f]]
  - [[#smarter-parentheses][Smarter Parentheses]]
- [[#dashboard][Dashboard]]
- [[#gui-tweaks][GUI tweaks]]
  - [[#beacon][Beacon]]
  - [[#display-line-numbers-os-gwelwch-yn-dda][Display line numbers, os gwelwch yn dda]]
  - [[#neo-tree-for-easy-file-navigation][Neo-tree for easy file navigation]]
  - [[#mode-line][Mode-line]]
- [[#pamala-isley-ivy][Pamala Isley (Ivy)]]
- [[#languages-tools-etc][Languages, tools, etc]]
  - [[#quarto][Quarto]]
  - [[#latex][LaTeX]]
  - [[#r-and-ess][R and ESS]]
  - [[#scala][Scala]]
  - [[#org-babel][Org-Babel]]
- [[#make-org-mode-good-actually][Make org-mode good, actually]]
  - [[#table-of-contents][Table of contents]]
  - [[#shootin-bullets][Shootin' Bullets]]
  - [[#disable-that-weird-indentation][Disable that weird indentation]]
  - [[#make-writing-lisp-blocks-easier][Make Writing Lisp blocks easier]]
  - [[#settings-tweaks][Settings Tweaks]]
  - [[#other-latex-tweaks][Other LaTeX tweaks]]
  - [[#auto-export-to-org][Auto Export to org]]
- [[#no-littering-][No Littering >:|]]
- [[#projectile][Projectile]]
  - [[#look-inot-this-and-learn-about-projects-in-this-sense][Look inot this and learn about projects in this sense]]
- [[#shells-and-terminals][Shells and terminals]]
  - [[#eshell][Eshell]]
- [[#sublimity][Sublimity]]
- [[#sudo-edit-do-you-know-who-i-am][Sudo-Edit; Do you know who I am?]]
- [[#which-key-oh-that-key][Which-Key? Oh, that key]]

* Elpaca and Keybindings

** Elpaca Package Manager

Using the elpaca file manager. has some nice stuff like async. Since I'm very unlikely to touch this code (it's basically ripped from their github), I may move this block elsewhere.

#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.6)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (call-process "git" nil buffer t "clone"
                                         (plist-get order :repo) repo)))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install use-package support
  (elpaca elpaca-use-package
          ;; Enable :elpaca use-package keyword.
          (elpaca-use-package-mode)
          ;; Assume :elpaca t unless otherwise specified.
          (setq elpaca-use-package-by-default t))

  ;; Block until current queue processed.
  (elpaca-wait)

  ;;When installing a package which modifies a form used at the top-level
  ;;(e.g. a package which adds a use-package key word),
  ;;use `elpaca-wait' to block until that package has been installed/configured.
  ;;For example:
  (use-package general :demand t)
  (elpaca-wait)


  ;;Turns off elpaca-use-package-mode current declaration
  ;;Note this will cause the declaration to be interpreted immediately (not deferred).
  ;;Useful for configuring built-in emacs features.
  (use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

  ;; Don't install anything. Defer execution of BODY
  ;; (elpaca nil (message "deferred"))

  (add-to-list 'load-path "~/.config/emacs/lisp/")
#+end_src

** My Keybindings

Custom keybinds. As the to-do list suggests, I should get into ~General~, setting a overall header to something unique like ~C-<space>~ then using a bunch of pneumonic commands, for a sort of 'vim-emacs' mashup. ~C-<space>~ is currently bound to some marking feature though.

#+begin_src emacs-lisp
  ;; Display the line numbers at the side of the window
  (global-set-key (kbd "C-c l") 'display-line-numbers-mode)

  ;; Quickly reload this file after making edits. Refers to a function defined under the tab 'neat-tricks'
  (global-set-key (kbd "C-c r") 'reload-init-file)

  ;; Quickly get to this file
  (global-set-key (kbd "C-c C-<return>") 'go-to-config)

  ;; Rearrange the buffers
  (global-set-key (kbd "C-M-<up>") 'buf-move-up)
  (global-set-key (kbd "C-M-<down>") 'buf-move-down)
  (global-set-key (kbd "C-M-<left>") 'buf-move-left)
  (global-set-key (kbd "C-M-<right>") 'buf-move-right)

  ;; Move focus
  (global-set-key (kbd "C-<up>") 'windmove-up)
  (global-set-key (kbd "C-<down>") 'windmove-down)
  (global-set-key (kbd "C-<left>") 'windmove-left)
  (global-set-key (kbd "C-<right>") 'windmove-right)

  ;; Todo
  (global-set-key (kbd "C-c t") 'org-toggle-item)
  (global-set-key (kbd "C-c d") 'org-todo)

  ;; Return to dashboard
  (global-set-key (kbd "C-c <return>") 'dashboard-open)

  ;; Org-Agenda Shortcut
  (global-set-key (kbd "C-c o") 'org-agenda)

#+end_src

** General Keybindings

#+begin_src emacs-nope
    (require 'general)

    (global-unset-key (kbd "C-c"))
    (global-unset-key (kbd "C-x"))
    (global-unset-key (kbd "C-v"))
    (global-unset-key (kbd "C-SPC"))
    (global-set-key (kbd "C-c") nil)

    (general-create-definer my-leader-def
      ;; :prefix my-leader
      ;; or without a variable
      :prefix "C-SPC")


    (my-leader-def
      "a" 'org-agenda
      "b" 'counsel-bookmark
      "c" 'org-capture
      "s" 'save-buffer
      "r c" 'reload-init-file
      "t l" 'display-line-numbers-mode
      "g c" 'go-to-config
      "g d" 'go-to-dashboard
      "g f" 'find-file
  )



    (general-define-key
     "C-c" 'kill-ring-save
     "C-x" 'kill-region
     "C-v" 'yank
     "C-h" 'backward-char
     "C-j" 'next-line
     "C-k" 'previous-line
     "C-l" 'forward-char
     "C-<up>" 'windmove-up
     "C-<down>" 'windmove-down
     "C-<left>" 'windmove-left
     "C-<right>" 'windmove-right)
#+end_src
** Some neat tricks

Here we actually define the functions references in the above keybindings
*** Reload Init
#+begin_src emacs-lisp
  (defun reload-init-file ()
    (interactive) ;; (interactive allows you to call the function with M-x
    (load-file user-init-file)
    (load-file user-init-file)
    (previous-buffer))
#+end_src

*** Go to config
#+begin_src emacs-lisp
  (defun go-to-config ()
    (interactive)
    (find-file "~/.config/emacs/config.org"))
#+end_src
