emacs/config.el
(defvar elpaca-installer-version 0.6)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; Install use-package support
(elpaca elpaca-use-package
        ;; Enable :elpaca use-package keyword.
        (elpaca-use-package-mode)
        ;; Assume :elpaca t unless otherwise specified.
        (setq elpaca-use-package-by-default t))

;; Block until current queue processed.
(elpaca-wait)

;;When installing a package which modifies a form used at the top-level
;;(e.g. a package which adds a use-package key word),
;;use `elpaca-wait' to block until that package has been installed/configured.
;;For example:
(use-package general :demand t)
(elpaca-wait)


;;Turns off elpaca-use-package-mode current declaration
;;Note this will cause the declaration to be interpreted immediately (not deferred).
;;Useful for configuring built-in emacs features.
(use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

;; Don't install anything. Defer execution of BODY
;; (elpaca nil (message "deferred"))

(add-to-list 'load-path "~/.config/emacs/lisp/")

;; Display the line numbers at the side of the window
(global-set-key (kbd "C-c l") 'display-line-numbers-mode)

;; Quickly reload this file after making edits. Refers to a function defined under the tab 'neat-tricks'
(global-set-key (kbd "C-c r") 'reload-init-file)

;; Quickly get to this file
(global-set-key (kbd "C-c C-<return>") 'go-to-config)

;; Rearrange the buffers
(global-set-key (kbd "C-M-<up>") 'buf-move-up)
(global-set-key (kbd "C-M-<down>") 'buf-move-down)
(global-set-key (kbd "C-M-<left>") 'buf-move-left)
(global-set-key (kbd "C-M-<right>") 'buf-move-right)

;; Move focus
(global-set-key (kbd "C-<up>") 'windmove-up)
(global-set-key (kbd "C-<down>") 'windmove-down)
(global-set-key (kbd "C-<left>") 'windmove-left)
(global-set-key (kbd "C-<right>") 'windmove-right)

;; Todo
(global-set-key (kbd "C-c t") 'org-toggle-item)
(global-set-key (kbd "C-c d") 'org-todo)

;; Return to dashboard
(global-set-key (kbd "C-c <return>") 'dashboard-open)

;; Org-Agenda Shortcut
(global-set-key (kbd "C-c o") 'org-agenda)

(defun reload-init-file ()
  (interactive) ;; (interactive allows you to call the function with M-x
  (load-file user-init-file)
  (load-file user-init-file)
  (previous-buffer))

(defun go-to-config ()
  (interactive)
  (find-file "~/.config/emacs/config.org"))
