emacs/config.org
* Dashboard

The nice dashboard. wait whats that fluffy white thing
#+begin_src emacs-lisp
  (use-package nerd-icons)

  (use-package dashboard
      :ensure t 
      :init
      (setq initial-buffer-choice 'dashboard-open)
      (setq dashboard-set-heading-icons t)
      (setq dashboard-set-file-icons t)
      (setq dashboard-banner-logo-title "woah what how did he get here")
      ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
      (setq dashboard-startup-banner "/home/tate/Tatemacs/wohhowdidhegethere/toby.gif")  ;; use custom image as banner
      (setq dashboard-center-content nil) ;; set to 't' for centered content
      (setq dashboard-items '((recents . 50)
                              (bookmarks . 10)))
      :custom
      (dashboard-modify-heading-icons '((recents . "file-text")
                                        ))
      :config
      (dashboard-setup-startup-hook)
      )

  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  (setq dashboard-display-icons-p t) ;; display icons on both GUI and terminal
  (setq dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
#+end_src

* GUI tweaks
** Beacon

Make the cursor glowwww

#+begin_src emacs-lisp
    (use-package beacon
      :ensure t
      :config (beacon-mode))
#+end_src
** Display line numbers, os gwelwch yn dda

Makes displaying line numbers the deafult. Toggle this with ~C-c l~ as defined under 'Keybindings'.



#+begin_src emacs-lisp

  (global-display-line-numbers-mode 0)
  (global-visual-line-mode t)
  
#+end_src

*** TODO Make this a hook to only enable in programming modes and not org-mode

** Neo-tree for easy file navigation

A nice file navigator for bigger 

#+begin_src emacs-lisp
  (use-package neotree)
  (global-set-key [f8] 'neotree-toggle)
  (setq neo-window-width 50)

  (use-package all-the-icons
    :ensure t
    :if (display-graphic-p))

  (use-package all-the-icons-dired
    :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src

** Mode-line
#+begin_src emacs-lisp
    ;; clean up the mode-line
    (use-package diminish)

    (use-package smart-mode-line
      :config (sml/setup))

    (use-package mode-icons
      :config (mode-icons-mode))
#+end_src
* Pamala Isley (Ivy)
Ivy is a generic completion mechanism for emacs, which comes with 'counsel', a collection of Ivy-enhanced versions of normal emacs commands.
Ivy-rich allows adding descriptions alongside the commands in M-x

#+begin_src emacs-lisp
  (use-package counsel
    :after ivy
    :diminish
    :config (counsel-mode))

  (use-package ivy
    :custom
    (setq ivy-use-virtual-buffers t)
    (setq ivy-count-format "(%d/%d) ")
    (setq enable-recursive-minibuffers t)
    :diminish
    :config
    (ivy-mode))

  ;;(use-package all-the-icons-ivy-rich
    ;;:ensure t
    ;;:init (all-the-icons-ivy-rich-mode 1))

  (use-package ivy-rich
    :after ivy
    :ensure t
    :init (ivy-rich-mode 1)
    :custom
    (ivy-virtual-abbreviate 'full
     ivy-rich-switch-buffer-align-virtual-buffer t
     ivy-rich-path-style 'abbrev)
    :config
    (ivy-set-display-transformer 'ivy-switch-buffer
                                 'ivy-rich-switch-buffer-transformer))
#+end_src

* Languages, tools, etc
** Quarto
#+begin_src emacs-lisp
  (use-package quarto-mode
    :mode (("\\.Rmd" . poly-quarto-mode))
    )
  (setq markdown-enable-math t)
#+end_src
** LaTeX
#+begin_src emacs-lisp
  (use-package auctex
  :defer t
  :ensure t)
  (setq org-highlight-latex-and-related '(native))

  (use-package cdlatex)
  (add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)
  (add-hook 'latex-mode-hook 'turn-on-cdlatex)
  (add-hook 'org-mode-hook #'turn-on-org-cdlatex)

  ;; Line below currently breaks things
  ;; (add-hook 'after-save-hook #'org-latex-export-to-pdf)
#+end_src
** R and ESS
#+begin_src emacs-lisp
  (use-package ess)
#+end_src
** Scala

#+begin_src emacs-lisp
  (require 'package)

  ;; Add melpa to your packages repositories
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

  (package-initialize)

  ;; Install use-package if not already installed
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'use-package)

  ;; Enable defer and ensure by default for use-package Keep
  ;; auto-save/backup files separate from source code:
  ;; https://github.com/scalameta/metals/issues/1027
  (setq use-package-always-defer t
        use-package-always-ensure t
        backup-directory-alist `((".*" . ,temporary-file-directory))
        auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))

  ;; Enable scala-mode for highlighting, indentation and motion commands
  (use-package scala-mode
    :interpreter ("scala" . scala-mode))

  ;; Enable sbt mode for executing sbt commands
  (use-package sbt-mode
    :commands sbt-start sbt-command
    :config
    ;; WORKAROUND: https://github.com/ensime/emacs-sbt-mode/issues/31
    ;; allows using SPACE when in the minibuffer
    (substitute-key-definition
     'minibuffer-complete-word
     'self-insert-command
     minibuffer-local-completion-map)
     ;; sbt-supershell kills sbt-mode:  https://github.com/hvesalai/emacs-sbt-mode/issues/152
     (setq sbt:program-options '("-Dsbt.supershell=false")))

  ;; Enable nice rendering of diagnostics like compile errors.
  (use-package flycheck
    :diminish
    :init (global-flycheck-mode))

  (use-package lsp-mode
    :diminish
    ;; Optional - enable lsp-mode automatically in scala files
    ;; You could also swap out lsp for lsp-deffered in order to defer loading
    :hook  (scala-mode . lsp)
           (lsp-mode . lsp-lens-mode)
    :config
    ;; Uncomment following section if you would like to tune lsp-mode performance according to
    ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
    ;; (setq gc-cons-threshold 100000000) ;; 100mb
    ;; (setq read-process-output-max (* 1024 1024)) ;; 1mb
    ;; (setq lsp-idle-delay 0.500)
    ;; (setq lsp-log-io nil)
    ;; (setq lsp-completion-provider :capf)
    (setq lsp-prefer-flymake nil)
    ;; Makes LSP shutdown the metals server when all buffers in the project are closed.
    ;; https://emacs-lsp.github.io/lsp-mode/page/settings/mode/#lsp-keep-workspace-alive
    (setq lsp-keep-workspace-alive nil))

  ;; Add metals backend for lsp-mode
  (use-package lsp-metals)

  ;; Enable nice rendering of documentation on hover
  ;;   Warning: on some systems this package can reduce your emacs responsiveness significally.
  ;;   (See: https://emacs-lsp.github.io/lsp-mode/page/performance/)
  ;;   In that case you have to not only disable this but also remove from the packages since
  ;;   lsp-mode can activate it automatically.
  (use-package lsp-ui)

  ;; lsp-mode supports snippets, but in order for them to work you need to use yasnippet
  ;; If you don't want to use snippets set lsp-enable-snippet to nil in your lsp-mode settings
  ;; to avoid odd behavior with snippets and indentation
  (use-package yasnippet)
  (use-package ivy-yasnippet
    :hook (yas-minor-mode . ivy-yasnippet))

  ;; Use company-capf as a completion provider.
  ;;
  ;; To Company-lsp users:
  ;;   Company-lsp is no longer maintained and has been removed from MELPA.
  ;;   Please migrate to company-capf.
  (use-package company
    :diminish
    :hook (scala-mode . company-mode)
    :config
    (setq lsp-completion-provider :capf))

  ;; Posframe is a pop-up tool that must be manually installed for dap-mode
  (use-package posframe)

  ;; Use the Debug Adapter Protocol for running tests and debugging
  (use-package dap-mode
    :hook
    (lsp-mode . dap-mode)
    (lsp-mode . dap-ui-mode))


#+end_src

** Org-Babel
#+begin_src emacs-lisp
      (org-babel-do-load-languages
      'org-babel-load-languages
      '(
	(R . t)
	(latex . t)
    ))

    ;; disable the confirmation message
    (setq org-confirm-babel-evaluate nil)
#+end_src

* Make org-mode good, actually
** Table of contents
#+begin_src emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Shootin' Bullets
#+begin_src emacs-lisp

  ;; Make the different levels indented
  (add-hook 'org-mode-hook 'org-indent-mode)

  ;; Use Bullets instead of Aterickses
  ;;(use-package org-bullets)
  ;;(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

#+end_src

** Disable that weird indentation
#+begin_src emacs-lisp
  (electric-indent-mode -1)
#+end_src

** Make Writing Lisp blocks easier
#+begin_src emacs-lisp
  (require 'org-tempo) ;; now we can write '<s' then press <TAB> for immediate src action!
#+end_src
