emacs/config.org
** Settings Tweaks
#+begin_src emacs-lisp
  (setq org-image-actual-width 500) ;; Sets the width of image previewq in org-mode

  ;; Sets the size of LaTeX previews 
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 0.9))
#+end_src
*** TODO Make a keybinding to quickly set the size of latex previews :config:
** Other LaTeX tweaks
#+begin_src emacs-lisp
  (use-package org-fragtog)
  (add-hook 'org-mode-hook 'org-fragtog-mode)

  (use-package math-preview
    :load-path "/home/tate/.asdf/plugins/math-preview"
    :custom (math-preview-command "/home/tate/.asdf/plugins/math-preview/math-preview.js"))

  (setq org-preview-latex-image-directory ".ltximg/")
#+end_src
** Auto Export to org
#+begin_src emacs-lisp
  (use-package ox-pandoc)
  (use-package auto-org-md)
#+end_src
* No Littering >:|
#+begin_src emacs-lisp

(use-package no-littering)

#+end_src
* Projectile
** TODO Look inot this and learn about projects in this sense
#+begin_src emacs-lispx
  (use-package projectile
    :config
    (projectile-mode 1))
#+end_src

* Shells and terminals
Honestly, my terminal solution makes me too happy to move to an emacs shell, but I'll make this placeholder anyway
** Eshell
#+begin_src emacs-lisp

#+end_src

* Sublimity
Smooth-scrolling and a scrolling minimap (which doesn't seem to work)
#+begin_src emacs-lisp
    (use-package sublimity
      :config (sublimity-mode))
#+end_src

* Sudo-Edit; Do you know who I am?
#+begin_src emacs-lisp
  (use-package sudo-edit)
#+end_src

* Which-Key? Oh, that key
#+begin_src emacs-lisp

  (use-package which-key
    :init
    (which-key-mode 1)
    :diminish
    :config
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-add-column-padding 1
          which-key-max-display-columns nil
          which-key-min-display-lines 56
          which-key-side-window-slot -10
          which-key-side-window-max-height 0.25
          which-key-idle-delay 0.8
          which-key-max-description-lenght 25
          which-key-allow-imprecise-window-fit nil
          which-key-seperator "➢"))

#+end_src



FFS LOAD THE AGENDA FILES

#+begin_src emacs-lisp

(setq org-agenda-file-menu-enabled t)

(setq org-agenda-files
        '("~/MyProjects/Notes/APTS" "~/MyProjects/Notes/APTS/StatsComputation" "~/MyProjects/Notes/APTS/StatsInference" "~/orgfiles"))

#+end_src
