emacs/config.el

(setq org-image-actual-width 500) ;; Sets the width of image previewq in org-mode

;; Sets the size of LaTeX previews 
(setq org-format-latex-options (plist-put org-format-latex-options :scale 0.9))

(use-package org-fragtog)
(add-hook 'org-mode-hook 'org-fragtog-mode)

(use-package math-preview
  :load-path "/home/tate/.asdf/plugins/math-preview"
  :custom (math-preview-command "/home/tate/.asdf/plugins/math-preview/math-preview.js"))

(setq org-preview-latex-image-directory ".ltximg/")

(use-package ox-pandoc)
(use-package auto-org-md)

(use-package no-littering)



(use-package sublimity
  :config (sublimity-mode))

(use-package sudo-edit)

(use-package which-key
  :init
  (which-key-mode 1)
  :diminish
  :config
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 56
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-max-description-lenght 25
        which-key-allow-imprecise-window-fit nil
        which-key-seperator "➢"))

(setq org-agenda-file-menu-enabled t)

(setq org-agenda-files
        '("~/MyProjects/Notes/APTS" "~/MyProjects/Notes/APTS/StatsComputation" "~/MyProjects/Notes/APTS/StatsInference" "~/orgfiles"))
